# <center><font face="arial" size="5" color=#0101DF>NUMERIQUE ET SCIENCES INFORMATIQUES Terminale NSI</font></center>

## <font color=#013ADF>Séquence N° 6 : Bases de données - Structured Query Language (SG</font>

<div class="alert alert-danger" role="alert">
    
Les objectifs de cette séquence sont :

- Identifier les concepts définissant le modèle relationnel ;
- Savoir distinguer la structure d'une base de données de son contenu ;
- Repérer des anomalies dans le schéma d'une base de données ;
- Identifier les services rendus par un système de gestion de bases de données relationnelles : persistance des données, gestion des accès concurrrents, efficacité de traitemenet des requêtes, sécurisation des accès ;
- Identifier les composants d'une requête ;
- Construire des requêtes d'interrogation à l'aide des clauses du langage SQL : SELECT, FROM, WHERE, JOIN ;
- Construire des requêtes d'insertion et de mise à jour à l'aide de : UPDATE, INSERT, DELETE.


</div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>
    
Travail préalable   

- Reprendre la séquence 8 "Données en table" de la classe de première (notebook "Elections.ipynb"):
    - vocabulaire : attribut, enregistrement, vecteur, projection, jointure, selection ;
    - Lecture/écriture de fichiers CSV (pour révison : pas utilisé dans cette séquence).
- Lire les chapitres 5  et 6 du livre.
    
*Remarques :*
- On ne vous demande pas de savoir réaliser un modèle Entité/Association (ou Relation), mais de savoir le lire.
- À ne pas perdre de vue : https://www.cnil.fr/fr/comprendre-le-rgpd
    
**Problématique :**

Comment stocker les données sur les élèves de terminale de l'école ainsi que leur ville de résidence sous forme d'un code postal et du libellé de la ville ?



| Id_eleve | nom     | prenom   |  statut   | code postal | libellé ville |
| :------: | ------- | -------- | :-------: | :---------: | :-----------: |
|    1     | Bourgon | Élise    | demi-pens |    29490    |   Guipavas    |
|    2     | Jacq    | Christine | demi-pens |    29820    |    Guilers    |
|    3     | Durand  | Mathis   |  externe  |    29200    |     Brest     |
|    4     | Gontran | Élouan   | demi-pens |    29290    |  Saint Renan  |
|    5     | Fox     | Titouan  | demi-pens |    29490    |   Guipavas    |
|    6     | Majo    | Aya      |  externe  |    29200    |     Brest     |
|    7     | Tripaux | Jean     |  interne  |    29160    |    Crozon     |
|    8     | Chavin  | Hassan   |  interne  |    29590    |    Le Faou    |
|    9     | Marvaux | Éloi     |  externe  |    29200    |     Brest     |
|    10    | Savino  | Manel    |  interne  |    29830    | Ploudalmézeau |

- On propose cette table. Que peut-on lui reprocher ?
- Revisons le vocabulaire : attribut, champ, domaine, donnée enregistrement, vecteur, n-uplet, relation, projection, sélection, jointure
<div>

<div class="alert alert-danger" role="alert">

- Redondance sur les codes postaux et villes → Volume de données (espace-disque) plus important ;
- Risque d'incohérence des données : anomalie à l'insertion/modification → saisie de valeurs identiques (déménagement).
    
Saisie du schéma ci-dessous avec  l'outil en ligne : http://www.mocodo.net/
<div>

### 1- Le modèle Entité/Association (ou relation)

<div class="alert alert-success">


<img src="Images/Villes.svg" alt="ville_db" width=30% align=center>   
    

**Comment lire ce modèle ?**
    
Une entité de la table **ELEVES** habite dans 1 et 1 seule VILLE ;

Une entité de la table **VILLE** est habité par 0 ou plusieurs (N) élèves.
    
**Compte-tenu des cardinalités**, il en résulte la **création de 2 tables** ayant les attributs suivants :
    
    
| Id_eleve | nom     | prenom   |  statut   | code postal |
| :------: | ------- | -------- | :-------: | :---------: |
|    1     | Bourgon | Élise    | demi-pens |    29490    |
|    2     | Jacq    | Christine | demi-pens |    29820    |
|    3     | Durand  | Mathis   |  externe  |    29200    |
|    4     | Gontran | Élouan   | demi-pens |    29290    |
|    5     | Fox     | Titouan  | demi-pens |    29490    |
|    6     | Majo    | Aya      |  externe  |    29200    |
|    7     | Tripaux | Jean     |  interne  |    29160    |
|    8     | Chavin  | Hassan   |  interne  |    29590    |
|    9     | Marvaux | Éloi     |  externe  |    29200    |
|    10    | Savino  | Manel    |  interne  |    29830    |
    
Où **Id_Eleve** est la **clé primaire** de la table **ELEVES** et **Code_postal** est la **clé étrangère**.
    
| code postal | libellé ville |
| :---------: | :-----------: |
|    29490    |   Guipavas    |
|    29820    |    Guilers    |
|    29200    |     Brest     |
|    29290    |  Saint Renan  |
|    29160    |    Crozon     |
|    29590    |    Le Faou    |
|    29830    | Ploudalmézeau |
    
Où **Code postal** est la **clé primaire** de la table **VILLE**.

<img src="Images/warning.png" alt="warning" width=5% align=left>
    
    
Clé primaire : permet d'accéder aux données d'un enregistrement de façon claire et unique.
    
Clé étrangère : Lien avec l'identifiant d'une autre table.
<div>

### 2- Le modèle relationnel

<div class="alert alert-success">

<img src="Images/modele_relationnel.png" alt="relationnel" width=40% align=center>
    
**ELEVE ( Id_eleve, nom, prenom, status, code postal )**
    
Le champ Id_eleve constitue la clef primaire de la table. C'était déjà un identifiant de l'entité ELEVE.
    
Les champs nom, prenom et status étaient déjà de simples attributs de l'entité ELEVE.
    
Le champ code postal est une clef étrangère. Il a migré à partir de l'entité VILLE par l'association de dépendance fonctionnelle HABITE en perdant son caractère identifiant.
    
**VILLE ( code postal, libelle_ville )**
    
Le champ code postal constitue la clef primaire de la table. C'était déjà un identifiant de l'entité VILLE.
    
Le champ libelle_ville était déjà un simple attribut de l'entité VILLE.
<div>

### 3- Le modèle physique : système de gestion de base de donnée relationnel (SGBD) relationnel

#### 3-1 Architecture 3 tiers

<img src="Images/architecture_3tiers.jpg" alt="serveurs" width=60% align=center>

L'architecture classique est une architecture à 3 niveaux, c'est-à-dire que l'on a une architecture partagée entre :

Le client qui demande des ressources (à partir de son navigateur)

Le serveur d'application (serveur http) : le serveur chargé de fournir la ressource mais faisant appel à un autre serveur (Apache Nginx ...)

Le serveur secondaire (serveur de base de données): fournit un service au premier serveur (Mysql, PostgreSQ ...)

#### 3-2 SQLite

**SQLite** est une bibliothèque qui propose un moteur de base de données relationnelle accessible par le langage SQL.

https://sql.sh/sgbd/sqlite

Contrairement aux serveurs de bases de données traditionnels, sa particularité est de ne pas reproduire le schéma habituel client-serveur mais d'être directement intégrée aux programmes. L'intégralité de la base de données (déclarations, tables, index et données) est stockée dans un fichier indépendant de la plateforme.

En parcourant les répertoires de Firefox : /home/user/.mozilla/firefox/l11uob7t.default/, on peut y trouver plusieurs bases SQLite dont celle des cookies : cookies.sqlite


**C'est cette option que nous allons choisir car moins lourde à mettre en oeuvre.**

Pour visualiser le contenu d'une base, on peut utiliser :

- DB browser for sqlite (à installer sur un poste) ;
- Un outil en ligne : https://extendsclass.com/sqlite-browser.html
- En ligne de commande ...

#### 3-3 Propriétés d'un SGBD (ACID)

<div class="alert alert-success">
    
Un SGBD doit assurer un ensemble de fonctions :

Le SGBD doit assurer la persistance des données. Il doit assurer la pérennité de la structure quelque soit les modifications. de plus l'accès aux données doit être garanti en toute circonstance : panne matérielle, logicielle, coupure de courant, etc.

Le SGBD doit gérer les accès concurrents. Tout comme le système d'exploitation linux étudié en première, il gère un système de droits et de privilèges pour des utilisateurs et des groupes d'utilisateurs.
    
Le SGBD doit être efficace. Cette efficacité tient à des algorithmes puissants qui ne sont pas 'visibles' par les utilisateurs.

Au sein d’une base de données, le terme de **transaction** désigne les opérations apportant des modifications aux données. Par exemple, un virement bancaire provoquant le débit du compte de l’émetteur et le crédit du compte du bénéficiaire est une transaction.

Ces transactions doivent toutefois présenter quatre propriétés visant à garantir leur validité même en cas d’erreur ou de pannes informatiques. Ces quatre propriétés sont l’**atomicité**, la **cohérence**, l’**isolation** et la **durabilité**. Afin de mémoriser facilement ces attributs, Andreas Reuter et Theo Härder ont inventé l’acronyme  » ACID  » en 1983.

L’**atomicité** des transactions au sein des bases de données signifie que tous les changements apportés aux données sont effectués totalement, ou pas du tout. Elle permet d’éviter que les changements prennent effet en cas de panne de l’application ou du serveur de la base de données en plein milieu de la transaction. Ainsi, la base de données ne risque pas d’être corrompue par des opérations imprévisibles et à moitié complétées.

La **cohérence** signifie que les transactions doivent respecter les contraintes d’intégrité des données de la base de données. Ainsi, une transaction qui commence avec un ensemble de données cohérent doit résulter par un ensemble de données cohérent. Pour maintenir la cohérence, un système de base de données peut abandonner les transactions qui risquent de provoquer une incohérence.

L’**isolation** signifie que les écritures et lectures des transactions réussies ne seront pas affectées par les écritures et lectures d’autres transactions, qu’elles soient ou non réussies.

La **durabilité** garantit que les transactions réussies survivront de façon permanente et ne seront pas affectées par d’éventuelles pannes ou problèmes techniques. Les changements apportés aux données doivent être permanents.

source : https://www.lebigdata.fr/acid-base-de-donnees-definition
    
<div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>
    
**Exercice**

Pour chacun des sénarios suivant dire laquelle des 4 propriétés ACID est mise en jeu :

1- On exécute intégralement une transaction. La machine exécutant le SGBD subit une panne de courant. Au redémarrage, l'effet de la transaction a bien été pris en compte.
    
2- Une table T2 contient des clés étrangères, référençant les clés d'une table T1. On exécute une transaction qui modifie T2. Après la transaction T2 contient toujours des clés étrangères.
    
3- Une transaction tente d'insérer 10 enregistrements dans une relation. L'insertion du 9ème enregistrement échoue, à cause d'une contrainte de clé primaire. La transaction est annulée et aucune des lignes ne se retrouve dans la relation.
    
4- Sur une relation R contenant un attribut "n" de type entier, on exécute deux transactions, "en même temps". La première ajoute 1 à toutes les données de l'attribut "n" et la seconde retire 1 à ce même attribut. Le contenu de la relation après exécution des transactions est le même.

<div class="alert alert-danger" role="alert">
    
1- Durabilité (journal de log)
    
2- Cohérence
    
3- Atomicité
    
4- Isolation

### 4- Le langage SQL (Structured Query Language)

Nous allons nous servir de la base de données décrite précédemment pour découvrir le langage SQL.

#### 4-1 Création d'une base de données

Nous allons créer 3 bases de données identiques de 3 manières puis nous poursuivrons au travers ce notebook. Nous reviendrons en projet sur la création et la manipulation d'une base de données avec python.

**4-1-1- Création en lignes de commande** :

    - Ouvrir un terminal et placez vous dans votre home ;
    - Création de la base de données que nous appelerons "MyDB1" : sqlite3 MyDB1.db
    - Vous êtes dans l'environnement sqlite, le prompt a changé ">"
    - Pour vérifier la création : .database
    - Pour obtenir de l'aide : .help
    - Pour sortir : .exit (CTRL + D)
    
Un fichier MyDB1.db doit être présent dans votre répertoire.

**4-1-2- Création à partir d'un script python** :

In [ ]:
import sqlite3
connexion = sqlite3.connect('MyDB2.db') # connection ,création si non existe
curseur=connexion.cursor() # création d'un objet pour réaliser des requêtes

Un fichier MyDB2.db doit être présent dans votre répertoire.

Vous pouvez maintenant supprimer ces deux bases.

**4-1-3- Création à partir du notebook** :

Grâce à l'extension **ipython-sql** qu'il faut activer en validant la cellule suivante, nous allons pouvoir faire des requêtes SQL.

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///terminale.db -- Création de la base de données "terminale.db"

#### 4-2 Création d'une table

<div class="alert alert-success">
    
Cette première table est un peu plus complexe à créer car elle possède une clé étrangère. La dernière ligne permet de déclarer une contrainte sur cette clé afin d'indiquer à SQLite que "code_postal" est une clé étrangère. SQLite sera alors responsable de maintenir la cohérence entre les deux tables "ELEVE" et "VILLE".
<div>

In [ ]:
%%sql sqlite://
    
CREATE TABLE ELEVE
(
Id_eleve INTEGER PRIMARY KEY,
nom TEXT NOT NULL,
prenom TEXT,
statut TEXT,
code_postal INTEGER NOT NULL,
FOREIGN KEY (code_postal) REFERENCES VILLE(code_postal)    
);

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>
    
Par analogie avec la création précédente, créer la table ville.
<div>

In [ ]:
%%sql sqlite://
    
CREATE TABLE VILLE 
(
code_postal INTEGER  NOT NULL PRIMARY KEY,
libelle_ville   TEXT
);

#### 4-3 Suppression d'une table

Si vous avez constaté une erreur après la création de la table et avant d'insérer des enregistrements, vous pouvez supprime une table avec la commande :

In [ ]:
%%sql sqlite://
    
DROP TABLE NOM_DE_LA_TABLE;

#### 4-4 Insertion des données

In [ ]:
%%sql sqlite://

INSERT INTO VILLE VALUES(29490,'Guipavas');
INSERT INTO VILLE VALUES(29820,'Guilers');
INSERT INTO VILLE VALUES(29200,'Brest');
INSERT INTO VILLE VALUES(29160,'Crozon');
INSERT INTO VILLE VALUES(29590,'Le Faou ');
INSERT INTO VILLE VALUES(29830,'Ploudalmézeau');
INSERT INTO VILLE VALUES(29290,'Saint Renan');

In [ ]:
%%sql sqlite://

INSERT INTO ELEVE VALUES(1,'Bourgon','Élise','demi-pens',29490);
INSERT INTO ELEVE VALUES(2,'Jacq','Christine','demi-pens',29820);
INSERT INTO ELEVE VALUES(3,'Durand','Mathis','externe',29200);
INSERT INTO ELEVE VALUES(4,'Gontran','Élouan','demi-pens',29290);
INSERT INTO ELEVE VALUES(5,'Fox','Titouan','demi-pens',29490 );
INSERT INTO ELEVE VALUES(6,'Majo','Aya','externe',29200 );
INSERT INTO ELEVE VALUES(7,'Tripaux','Jean','interne',29160 );
INSERT INTO ELEVE VALUES(8,'Chavin','Hassan','interne',29590 );
INSERT INTO ELEVE VALUES(9,'Marvaux','Éloi','externe',29200 );
INSERT INTO ELEVE VALUES(10,'Savino','Manel','interne',29830 );

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

Avant d'aller plus loin, verifier vos saisies avec l'éditeur en ligne par exemple : https://extendsclass.com/sqlite-browser.html
<div>

#### 4-5 Interroger la base de données

<div class="alert alert-success">
    
Plutôt que d'utiliser l'outil en ligne, on aurait pu interroger la base de données. C'est ce que nous allons faire maintenant.
<div>

In [ ]:
%%sql sqlite://

SELECT * FROM ELEVE;

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler votre requête pour afficher l'intégralité de la table VILLE.
<div>

In [ ]:
%%sql sqlite://

SELECT * FROM VILLE;

<div class="alert alert-success">
    
Afinons un peu les recherches en utilisant des clauses du langage SQL : WHERE, LIKE, COUNT, ORDER BY, DISTINCT, DESC et JOIN
    
- Voici une requête qui doit me donner le nom, prénom et le statut de tous les élèves qui habitent à Brest, autrement dit, qui ont le code postal 29200.
    
<div>

In [ ]:
%%sql sqlite://

SELECT nom, prenom, statut FROM ELEVE WHERE code_postal= 29200;

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler des requêtes qui donnent les résultats suivants :
    - La liste des élèves (nom et prénom) internes ;
    - La ville dont le code postal est 29830
<div>

In [ ]:
%%sql sqlite://

SELECT nom, prenom FROM ELEVE WHERE statut= 'interne';

In [ ]:
%%sql sqlite://

SELECT libelle_ville FROM VILLE WHERE code_postal= 29830;

<div class="alert alert-success">
    
Afinons un peu les recherches en utilisant des clauses du langage SQL : WHERE, LIKE, COUNT, ORDER BY, DISTINCT,  DESC et JOIN
    
- Voici une requête qui doit me donner le nom, prénom et le statut de tous les élèves qui habitent à Brest, autrement dit, qui ont le code postal 29200.
<div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Que fait cette requête ? Détailler le rôle de chaque clause.
<div>

In [ ]:
%%sql sqlite://
    
SELECT nom, prenom FROM ELEVE WHERE nom LIKE 'C%' OR prenom LIKE 'M%';

<div class="alert alert-danger" role="alert">
    
On sélectionne le nom et le prénom de la table ELEVE où le nom commence par C ou le prenom commence par M.
<div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Par analogie avec la précédente, formuler une requête qui donne la liste des élèves (nom et prénom) dont le nom commence par D et qui sont externes.
<div>

In [ ]:
%%sql sqlite://
    
SELECT nom, prenom FROM ELEVE WHERE statut='externe' AND nom LIKE 'D%';

<div class="alert alert-success">
     
- Voici une requête qui doit me donner le nombre d'élèves qui habitent à Brest.
    
Remarque : D'autres fonctions de groupe existent : AVG, SUM, MIN, MAX (à vous de tester et d'identifer la fonction)
<div>

In [ ]:
%%sql sqlite://
    
SELECT COUNT(*) FROM ELEVE WHERE code_postal=29200;

<div class="alert alert-success">
     
- Voici une requête qui me donne le nom et prénom des élèves par ordre croissant (lexicographique). Por l'avoir dans l'ordre décroissant, il faut rajouter DESC à la fin de la requête.
<div>

In [ ]:
%%sql sqlite://
    
SELECT nom, prenom FROM ELEVE ORDER BY nom;

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête qui me donne la liste des codes postaux de la table ELEVE dans l'ordre croissant.

J'aurais pu les obtenir et sans doublons à partir de la table VILLE. Cela va nous permettre d'introduire une nouvelle clause : DISTINCT.
    
- Placer la clause DISTINCT après le SELECT et constater la différence.
<div>

In [ ]:
%%sql sqlite://
    
SELECT code_postal FROM ELEVE ORDER BY code_postal;

In [ ]:
%%sql sqlite://
    
SELECT DISTINCT code_postal FROM ELEVE ORDER BY code_postal;

<div class="alert alert-success">
     
Nous allons maintenant aborder des requêtes qui vont porter sur les 2 tables pour réaliser des jointures.
    
- Voici une premiere requête qui me donne le nom et prénom des élèves et la ville de résidence écrite de manière "classique", puis une seconde exploitant le fait que l'attribut "code_postal" est identique dans les 2 tables.
    
Remarque : Lorsqu'il y a ambiguïté sur le nom de l'attribut, on le fait précéder du nom de la table. attribut.
<div>

In [ ]:
%%sql sqlite://
    
SELECT nom, prenom, libelle_ville FROM ELEVE JOIN VILLE ON ELEVE.code_postal = VILLE.code_postal;

In [ ]:
%%sql sqlite://
    
SELECT nom, prenom, libelle_ville FROM ELEVE JOIN VILLE USING (code_postal);

#### 4-6 Insertion et mise à jour de la base de données

<div class="alert alert-success">
<img src="Images/warning.png" alt="Attention" width=5% align=left>
     
Il faudra manipuler les requêtes qui vont suivre avec précaution car elles peuvent effacer des données, mais aussi altérer la cohérence des données.
    
**Conseil** : tester votre requête avec la clause SELECT. Si vous obtenez les données que vous voulez supprimer ou modifier, modifier la clause par DELETE ou DELETE.
<div>

<div class="alert alert-success">
     
- Voici une requête insere dans la table VILLE, le code postal et le libellé de la ville LE CONQUET : 29232.
<div>

In [ ]:
%%sql sqlite://
    
INSERT INTO VILLE (code_postal, libelle_ville) VALUES (29232,'Le Conquet');

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour vérifier l'insertion.
<div>

In [ ]:
%%sql sqlite://
    
SELECT * FROM VILLE

<div class="alert alert-success">

Hélas, je me suis trompé de code postal. Il s'agissait du 29217 !

- Voici une requête qui devrait rectifier l'erreur.
<div>

In [ ]:
%%sql sqlite://
    
UPDATE VILLE SET code_postal=29217 WHERE libelle_ville='Le Conquet';

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour vérifier la modification.
<div>

In [ ]:
%%sql sqlite://
    
SELECT * FROM VILLE

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

    
Fox titouan a déménagé sur Le Conquet. Il choisit de venir à l'internat de l'école.
    
- Formuler une requête unique pour procéder aux modifications.
<div>

In [ ]:
%%sql sqlite://
    
UPDATE ELEVE SET statut='interne',code_postal=29217 WHERE nom='Fox';

In [ ]:
%%sql sqlite://
    
SELECT * FROM ELEVE;

<div class="alert alert-success">

Je m'aperçois un peu tardivement que pour la gestion de l'internat, il aurait été souhaitable d'avoir le sexe de la personne.

- Voici une requête va permettre de rajouter un attribut "sexe" à la table ELEVES.
<div>

In [ ]:
%%sql sqlite://
    
ALTER TABLE ELEVE ADD COLUMN sexe TEXT;

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour constater la modification et le type de donnée.
<div>

In [ ]:
%%sql sqlite://
    
SELECT * FROM ELEVE;

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

    
Majo aya a déménagé et n'est plus au lycée. Il faut supprimer son enregistrement.
    
- Voici la requête qui convient.
<div>

In [ ]:
%%sql sqlite://
    
DELETE FROM ELEVE WHERE nom='Majo';

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour constater la modification et le type de donnée.
<div>

In [ ]:
%%sql sqlite://
    
SELECT * FROM ELEVE;

<div class="alert alert-success">

Un nouvel élève arrive au lycée. Il s'agit de Monsieur Kappra Marcel qui habite à Saint Renan et qui sera externe.

- Formuler une requête pour insérer cet enregistrement.
<div>

In [ ]:
%%sql sqlite://
    
INSERT INTO ELEVE (Id_eleve, nom, prenom, statut, code_postal, sexe) VALUES (6,'Kappra', 'Marcel', 'externe','29290','M');

In [ ]:
%%sql sqlite://
    
SELECT * FROM ELEVE;

<div class="alert alert-success">

    
Pour apprendre à supprimer une table, nous allons en créer une à l'aide d'une requête. Nous allons créer une table "Liste" qui contiendra le nom, le prénom et la ville.
    
- Voici la requête .
<div>

In [ ]:
%%sql sqlite://

CREATE TABLE Liste AS SELECT nom, prenom, libelle_ville FROM ELEVE JOIN VILLE USING (code_postal);

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- Formuler une requête pour constater la modification et le type de donnée.
<div>

In [ ]:
%%sql sqlite://

SELECT * FROM Liste;

<div class="alert alert-success">

Voici la requête pour supprimer une table.
<div>

In [ ]:
%%sql sqlite://
    
DROP TABLE Liste;

Pour vous entraîner :

http://deptfod.cnam.fr/bd/tp/

https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all

### 5- Un autre exemple avec python

<div class="alert alert-success">

Voici le modèle Entité/Association de la nouvelle base de données que l'on souhaite. Il s'agit de répertorier les élèves dans les groupes de spécialités et d'y associer un enseignant.
    
<img src="Images/Specialites.svg" alt="ville_db" width=60% align=center>   
    
Pour s'adapter aux classes de premières et terminales, 3 spécialités sont disponibles pour l'élève. Les enseignants ne peuvent intervenir que dans 2 spécialités au maximum.
    
    
<div>

<div class="alert alert-success">

Voici le modèle relationnel de la nouvelle base de données que l'on souhaite. Il s'agit de répertorier les élèves dans les groupes de spécialités et d'y associer un enseignant.
    
<img src="Images/Specialites.png" alt="specialites_db" width=80% align=center>   
    
**Pour information** : Pour passer du modèle Entité/Association au modèle relationnel, il y a 3 règles :
    
*Règle 1 : entité*

*– Chaque entité donne une table.*

*Règle 2 : association de type 1-n ou 1-1*

*– L'identifiant de l'entité côté n est ajoutée du côté 1 où elle devient clé étrangère.*

*Règle 3 : association de type n-n*

*– Création d'une nouvelle table dont la clé primaire est l'ensemble des identifiants des entités concernées.*
    
    
<div>

<div class="alert alert-success">
    
Le script ci-dessous crée :
- Une base de données "specialites.db" ;
- Les tables "eleves", "groupes", "enseignants" et "forme";

Puis
    
- Valide les modifications avec un "commit" ;
- Cloture la connection avec la base de donnée.

On reconnaîtra les requêtes SQL.
    
Tout ce travail sera réalisé grâce à un objet "cursor".
<br><br>

*Remarque : pour éviter les messages d'erreur si vous executez 2 fois le script ci-dessous, j'ai prévu de supprimer les tables. donc évidemment le 'IF NOT EXISTS' est superflu.*
<div>

In [18]:
import sqlite3
connexion = sqlite3.connect('specialites.db') # connection ,création si non existe
curseur=connexion.cursor() # création d'un objet pour réaliser des requêtes

curseur.executescript(
    
        """

        DROP TABLE IF EXISTS enseignants;
        
        CREATE TABLE IF NOT EXISTS enseignants
        (
        id_ens INTEGER PRIMARY KEY,
        nom_ens TEXT NOT NULL,
        prenom_ens TEXT,
        sp1_ens TEXT NOT NULL,
        sp2_ens TEXT NOT NULL
        );
        
        DROP TABLE IF EXISTS eleves;
        
        CREATE TABLE IF NOT EXISTS eleves
        (
        id_eleve INTEGER PRIMARY KEY,
        nom_el TEXT NOT NULL,
        prenom_el TEXT,
        classe INTEGER NOT NULL,
        sp1 TEXT NOT NULL,
        sp2 TEXT NOT NULL,
        sp3 TEXT
        );
        
        DROP TABLE IF EXISTS groupes;
        
        CREATE TABLE IF NOT EXISTS groupes
        (
        id_groupe INTEGER PRIMARY KEY,
        nom_groupe TEXT NOT NULL,
        nom_salle TEXT ,
        id_enseignant INTEGER,
        FOREIGN KEY (id_enseignant) REFERENCES enseignants(id_ens)
        );
                
        DROP TABLE IF EXISTS forme;
        
        CREATE TABLE IF NOT EXISTS forme
        (
        id_eleve INTEGER,
        id_groupe INTEGER,
        FOREIGN KEY (id_eleve) REFERENCES eleves(id_eleve),
        FOREIGN KEY (id_groupe) REFERENCES eleves(id_groupes)
        );
        
        """
        )


connexion.commit() # valide les modifications

connexion.close() # déconnexion

<div class="alert alert-success">
    
Le script ci-dessous remplit les tables de quelques valeurs.
    
*Remarque : pour éviter les messages d'erreur si vous executez 2 fois le script ci-dessous, il faut ré-exécuter le script ci-dessus, c'est à dire supprimer les tables et les reconstruire.*
   
<div>

In [19]:
import sqlite3
connexion = sqlite3.connect('specialites.db') # connection ,création si non existe
curseur=connexion.cursor() # création d'un objet pour réaliser des requêtes

                      
# À partir d'un script pour plusieurs requêtes
# finir la ligne de commande par un ;
curseur.executescript("""       
        INSERT INTO enseignants(id_ens,nom_ens,prenom_ens,sp1_ens,sp2_ens) VALUES (1,'DURANT','Pierre','SES','NSI');
        INSERT INTO enseignants(id_ens,nom_ens,prenom_ens,sp1_ens,sp2_ens) VALUES (2,'DUPOND','Thierry','SES','SI');
        INSERT INTO enseignants(id_ens,nom_ens,prenom_ens,sp1_ens,sp2_ens) VALUES (3,'NOAES','Gisèle','SI','Math');
        INSERT INTO enseignants(id_ens,nom_ens,prenom_ens,sp1_ens,sp2_ens) VALUES (4,'EXCES','Carole','Hist-Geo','Arts');
        INSERT INTO enseignants(id_ens,nom_ens,prenom_ens,sp1_ens,sp2_ens) VALUES (5,'STEFAN','Stéphane','Arts','LLCE')

        """)

curseur.executescript("""
        INSERT INTO eLeves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (1,'GOILLON','Jérôme',658,'Arts','Math','');
        INSERT INTO eleves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (2,'HELIES','Alice',654,'SI','NSI','');
         INSERT INTO eLeves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (3,'ELAN','Jérôme',658,'Math','NSI','');
        INSERT INTO eleves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (4,'GARILLO','isidore',654,'SI','NSI','');
         INSERT INTO eLeves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (5,'FINUSSON','Oscar',658,'Math','NSI','');
        INSERT INTO eleves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (6,'DROPLIT','Gisèle',654,'SI','Arts','');
         INSERT INTO eLeves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (7,'CHICAGO','Thierry',658,'Math','NSI','');
        INSERT INTO eleves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (8,'DISRUT','Nora',654,'Hist-Geo','Math','');
        INSERT INTO eleves(id_eleve,nom_el,prenom_el,classe,sp1,sp2,sp3) VALUES (9,'NOUILLE','Gilles',659,'SES','Hist-Geo','')
        """)

# exécution de plusieurs requêtes d'insertion : méthode 1
# liste de tuples
definir_groupe1=[(1,'NSI','K203',1),(2,'Math','I202',3),(3,'SI','K003',2)]
for donnee in definir_groupe1:
    curseur.execute("INSERT INTO groupes (id_groupe,nom_groupe,nom_salle,id_enseignant) VALUES (?,?,?,?)", donnee)

# la méthode executemany se passera de la boucle
definir_groupe2=[(4,'SES','M301',1),(5,'Hist-Geo','M202',4),(6,'Arts','G003',5)]
curseur.executemany("INSERT INTO groupes (id_groupe,nom_groupe,nom_salle,id_enseignant) VALUES (?,?,?,?)", definir_groupe2)

# À partir d'un tuple de dictionnaires
forme_groupe =({'id_el':1,'id_gr':6},
                {'id_el':1,'id_gr':2},
                {'id_el':2,'id_gr':3},
                {'id_el':2,'id_gr':1},
                {'id_el':3,'id_gr':2},
                {'id_el':3,'id_gr':1},
                {'id_el':4,'id_gr':3},
                {'id_el':4,'id_gr':1},
                {'id_el':5,'id_gr':2},
                {'id_el':5,'id_gr':1},
                {'id_el':6,'id_gr':3},
                {'id_el':6,'id_gr':6},
                {'id_el':7,'id_gr':2},
                {'id_el':7,'id_gr':1},
                {'id_el':8,'id_gr':5},
                {'id_el':8,'id_gr':2},
                {'id_el':9,'id_gr':4},
                {'id_el':9,'id_gr':5})
curseur.executemany("INSERT INTO forme (id_eleve,id_groupe) VALUES (:id_el,:id_gr)", forme_groupe )


connexion.commit() # valide les modifications

connexion.close() # déconnexion

<div class="alert alert-success">

Formuler des requêtes pour interroger la base de données.
<div>

In [ ]:
import sqlite3
connexion = sqlite3.connect('specialites.db') # connection ,création si non existe
curseur=connexion.cursor() # création d'un objet pour réaliser des requêtes

requete = "SELECT * FROM eleves;"
curseur.execute(requete)
resultats = curseur.fetchall()
print(resultats)

connexion.commit() # valide les modifications
connexion.close() # déconnexion

<div class="alert alert-success">

Création d'une fonction
<div>

In [ ]:
def specialites(curs, id):
    requete = "SELECT sp1, sp2 FROM eleves WHERE id_eleve = ?" # ? : variable à insérer
    curs.execute(requete, [id]) # [] liste des valeurs à substituer dans la requête
    resultats = curs.fetchall()
    if len(resultats) == 0:
        return f'Cet élève n\'existe pas'
    return resultats[0][0],resultats[0][1]

In [ ]:
import sqlite3
connexion = sqlite3.connect('specialites.db') # connection ,création si non existe
curseur=connexion.cursor() # création d'un objet pour réaliser des requêtes

id=1 # id de l'élève
print(specialites(curseur, id))

connexion.close() # déconnexion

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

Avant d'aller plus loin, une requête difficile que nous ne pouvions pas faire sur la base de données précédentes.
    
- Formuler une requête qui me donne la liste des élèves (nom prénom ) d'une spécialité et l'enseignant associé.
    
<div>

In [1]:
%load_ext sql

In [20]:
%%sql sqlite:///specialites.db

SELECT * FROM eleves

Done.

[(1, 'GOILLON', 'Jérôme', 658, 'Arts', 'Math', ''),
 (2, 'HELIES', 'Alice', 654, 'SI', 'NSI', ''),
 (3, 'ELAN', 'Jérôme', 658, 'Math', 'NSI', ''),
 (4, 'GARILLO', 'isidore', 654, 'SI', 'NSI', ''),
 (5, 'FINUSSON', 'Oscar', 658, 'Math', 'NSI', ''),
 (6, 'DROPLIT', 'Gisèle', 654, 'SI', 'Arts', ''),
 (7, 'CHICAGO', 'Thierry', 658, 'Math', 'NSI', ''),
 (8, 'DISRUT', 'Nora', 654, 'Hist-Geo', 'Math', ''),
 (9, 'NOUILLE', 'Gilles', 659, 'SES', 'Hist-Geo', '')]

In [22]:
%%sql sqlite:///specialites.db

SELECT * FROM eleves JOIN forme USING (id_eleve) JOIN groupes USING(id_groupe);

Done.

[(1, 'GOILLON', 'Jérôme', 658, 'Arts', 'Math', '', 6, 'Arts', 'G003', 5),
 (1, 'GOILLON', 'Jérôme', 658, 'Arts', 'Math', '', 2, 'Math', 'I202', 3),
 (2, 'HELIES', 'Alice', 654, 'SI', 'NSI', '', 3, 'SI', 'K003', 2),
 (2, 'HELIES', 'Alice', 654, 'SI', 'NSI', '', 1, 'NSI', 'K203', 1),
 (3, 'ELAN', 'Jérôme', 658, 'Math', 'NSI', '', 2, 'Math', 'I202', 3),
 (3, 'ELAN', 'Jérôme', 658, 'Math', 'NSI', '', 1, 'NSI', 'K203', 1),
 (4, 'GARILLO', 'isidore', 654, 'SI', 'NSI', '', 3, 'SI', 'K003', 2),
 (4, 'GARILLO', 'isidore', 654, 'SI', 'NSI', '', 1, 'NSI', 'K203', 1),
 (5, 'FINUSSON', 'Oscar', 658, 'Math', 'NSI', '', 2, 'Math', 'I202', 3),
 (5, 'FINUSSON', 'Oscar', 658, 'Math', 'NSI', '', 1, 'NSI', 'K203', 1),
 (6, 'DROPLIT', 'Gisèle', 654, 'SI', 'Arts', '', 3, 'SI', 'K003', 2),
 (6, 'DROPLIT', 'Gisèle', 654, 'SI', 'Arts', '', 6, 'Arts', 'G003', 5),
 (7, 'CHICAGO', 'Thierry', 658, 'Math', 'NSI', '', 2, 'Math', 'I202', 3),
 (7, 'CHICAGO', 'Thierry', 658, 'Math', 'NSI', '', 1, 'NSI', 'K203', 1),
 (8, 'DISRUT', 'Nora', 654, 'Hist-Geo', 'Math', '', 5, 'Hist-Geo', 'M202', 4),
 (8, 'DISRUT', 'Nora', 654, 'Hist-Geo', 'Math', '', 2, 'Math', 'I202', 3),
 (9, 'NOUILLE', 'Gilles', 659, 'SES', 'Hist-Geo', '', 4, 'SES', 'M301', 1),
 (9, 'NOUILLE', 'Gilles', 659, 'SES', 'Hist-Geo', '', 5, 'Hist-Geo', 'M202', 4)]

In [23]:
%%sql sqlite:///specialites.db

SELECT * FROM groupes JOIN enseignants ON id_enseignant=id_ens;

Done.

[(1, 'NSI', 'K203', 1, 1, 'DURANT', 'Pierre', 'SES', 'NSI'),
 (2, 'Math', 'I202', 3, 3, 'NOAES', 'Gisèle', 'SI', 'Math'),
 (3, 'SI', 'K003', 2, 2, 'DUPOND', 'Thierry', 'SES', 'SI'),
 (4, 'SES', 'M301', 1, 1, 'DURANT', 'Pierre', 'SES', 'NSI'),
 (5, 'Hist-Geo', 'M202', 4, 4, 'EXCES', 'Carole', 'Hist-Geo', 'Arts'),
 (6, 'Arts', 'G003', 5, 5, 'STEFAN', 'Stéphane', 'Arts', 'LLCE')]

In [31]:
%%sql sqlite:///specialites.db

SELECT nom_el, prenom_el, nom_ens, prenom_ens FROM eleves JOIN forme USING (id_eleve) JOIN groupes USING (id_groupe) JOIN enseignants ON id_enseignant=id_ens WHERE (sp1='NSI' OR sp2='NSI') AND nom_groupe='NSI' ;

Done.

[('HELIES', 'Alice', 'DURANT', 'Pierre'),
 ('ELAN', 'Jérôme', 'DURANT', 'Pierre'),
 ('GARILLO', 'isidore', 'DURANT', 'Pierre'),
 ('FINUSSON', 'Oscar', 'DURANT', 'Pierre'),
 ('CHICAGO', 'Thierry', 'DURANT', 'Pierre')]

### 6- Récupération de données en Open Data

<div class="alert alert-success">

La saisie de données reste le point laborieux. Il existe sur Internet des jeux de données disponibles mise à la disposition de tous. C'est l'Opendata.
    
L'année dernière, lors de la séquence "Données en table", nous avons abordé ces notions et également le format de fichiers nommmé "CSV".
    
Nous allons ici utiliser des données issues de la métropole brestoise au format CSV. Grâce à une fonction qui va lire ce fichier, nous allons peupler une base de données. Nous pourrons ainsi manipuler une quantité de données importante plus significative d'une base réelle.
    
Quelques sites : 

https://www.data.gouv.fr/fr/organizations/brest-metropole-oceane/

https://opendata.finistere.fr/explore/?sort=modified

https://www.data.gouv.fr/fr/
<div>

<div class="alert alert-warning">
<img src="Images/CR.png" alt="logo CR" width=5% align=right>

- En suivant le premier ce lien : https://www.data.gouv.fr/fr/organizations/brest-metropole-oceane/, télécharger la liste des arrêts et horaires des bus et tramways ;
- Décompresser le fichier, vous y trouverez le fichier 'stops.txt' qui est au format CSV ;
- En reprenant vos documents de l'année dernière, créer une fonction qui lit ce fichier ;
- En s'inspirant des exemples en python fournis plus haut, créer une base de donnees 'transports.db' et une table 'arrets' ;
- Créer une fonction qui alimente la table 'arret' avec les données du fichier 'stops.txt';
- Créer une fonction qui renvoie les coordonnées GPS de l'arrêt lors que l'on lui passe en argument, le nom de l'arrêt.
- Créer une fonction qui renvoie le nombre d'arrêts avec accès pour fauteuil roulant.
<div>

In [ ]:
import csv
import sqlite3

def create_table(conn,curs):
    curs.executescript(
    """
    DROP TABLE IF EXISTS arrets;
    
    CREATE TABLE IF NOT EXISTS arrets (
    stop_id TEXT PRIMARY KEY,
    stop_code TEXT,
    stop_name TEXT,
    stop_desc TEXT,
    stop_lat TEXT,
    stop_long TEXT,
    zone_id TEXT,
    stop_url TEXT,
    location_type TEXT,
    parent_station TEXT,
    wheelchair_boarding TEXT
    );
    """
    )
    conn.commit() # valide les modifications
    
def lecture_fichier(fichier) :
    """
    La fonction lit le fichier csv et calcule le nombre d'inscrits
    Entrée : fichier csv
    Sortie : nombre de suffrages exprimés de type entier
    """
    with open(fichier) as csv_file:
        liste= list(csv.reader(csv_file, delimiter=',')) # Récupération d'une liste de liste
        liste.pop(0)
    return liste

def peuple_table(conn,curs, enregistrements):
    for enregistrement in enregistrements:
        requete = "INSERT INTO arrets (stop_id,stop_code,stop_name,stop_desc,stop_lat,stop_long,zone_id,stop_url,location_type,parent_station,wheelchair_boarding) VALUES(?,?,?,?,?,?,?,?,?,?,?)"
        curs.execute(requete, enregistrement) # liste des valeurs à substituer dans la requête
        conn.commit() # valide les modifications

def coordonnees_gps(conn, curs,nom):
    requete = "SELECT stop_lat, stop_long FROM arrets WHERE stop_name = ?" # ? : variable à insérer
    curs.execute(requete, [nom]) # [] liste des valeurs à substituer dans la requête
    resultats = curs.fetchall()
    return f'Les coordonnées GPS de l\'arrêt {nom} sont : {resultats[0][0]} et {resultats[0][1]}'

def nb_fauteuils(conn,curs):
    requete = "SELECT COUNT(*) FROM arrets WHERE wheelchair_boarding = 1"
    curs.execute(requete)
    nombre = curs.fetchone()
    return f'Le nombre d\'arrêt permettant l\'accès à un fauteuil roulant est {nombre[0]}'

connexion = sqlite3.connect('transports.db') # connection ,création si non existe
curseur=connexion.cursor() # création d'un objet pour réaliser des requêtes

create_table(connexion, curseur)
liste=lecture_fichier('stops.txt')
peuple_table(connexion,curseur,liste)
station='Liberté Multiplexe'
print(coordonnees_gps(connexion, curseur, station))
print(nb_fauteuils(connexion,curseur))

connexion.close() # déconnexion

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///specialites.db -- Connexion à la base de données

In [ ]:
%%sql sqlite://

SELECT * FROM eleves;

In [ ]:
%%sql sqlite://

SELECT nom_eleve, prenom_eleve FROM eleves WHERE sp1='NSI' OR sp2='NSI' OR sp3='NSI';

In [ ]:
%%sql sqlite://

SELECT nom_eleve, prenom_eleve, sp1, sp2, nom_ens, prenom_ens, sp1_ens, sp2_ens FROM eleves JOIN forme USING(id_eleve) JOIN groupes USING(id_groupe) JOIN enseignants USING (id_ens);

In [ ]:
%%sql sqlite://

SELECT nom_eleve,